Repository: andrekirst/kgv_migration
Catalog: src/KGV.API/Resources/Services.ErrorLocalizationService.*.resx
Languages: de_de

# Error.BadRequest
source: Bad Request
de_de: Ungültige Anfrage

# Error.Unauthorized
source: Unauthorized
de_de: Nicht autorisiert

# Error.Forbidden
source: Forbidden
de_de: Zugriff verweigert

# Error.NotFound
source: Not Found
de_de: Nicht gefunden

# Error.Conflict
source: Conflict
de_de: Konflikt

# Error.UnprocessableEntity
source: Validation Error
de_de: Validierungsfehler

# Error.TooManyRequests
source: Too Many Requests
de_de: Zu viele Anfragen

# Error.InternalServerError
source: Internal Server Error
de_de: Interner Serverfehler

# Validation.Title
source: One or more validation errors occurred
de_de: Ein oder mehrere Validierungsfehler sind aufgetreten

# Validation.Generic
source: Validation error
de_de: Validierungsfehler

# Validation.Required
source: The {0} field is required
de_de: Das Feld {0} ist erforderlich

# Validation.Range
source: The {0} field must be between {1} and {2}
de_de: Das Feld {0} muss zwischen {1} und {2} liegen

# Validation.StringLength
source: The {0} field must be between {1} and {2} characters long
de_de: Das Feld {0} muss zwischen {1} und {2} Zeichen lang sein

# Validation.Email
source: The {0} field must contain a valid email address
de_de: Das Feld {0} muss eine gültige E-Mail-Adresse enthalten

# Validation.RegularExpression
source: The {0} field has an invalid format
de_de: Das Feld {0} hat ein ungültiges Format

# BusinessRule.BezirkNotFound
source: The specified district was not found
de_de: Der angegebene Bezirk wurde nicht gefunden

# BusinessRule.BezirkHasApplications
source: The district cannot be deleted because it has associated applications
de_de: Der Bezirk kann nicht gelöscht werden, da noch Anträge vorhanden sind

# BusinessRule.BezirkNameExists
source: A district with this name already exists
de_de: Ein Bezirk mit diesem Namen existiert bereits

# BusinessRule.ParzelleNotFound
source: The specified plot was not found
de_de: Die angegebene Parzelle wurde nicht gefunden

# BusinessRule.ParzelleNotAvailable
source: The plot is not available for assignment
de_de: Die Parzelle ist nicht für eine Vergabe verfügbar

# BusinessRule.ParzelleAlreadyAssigned
source: The plot is already assigned
de_de: Die Parzelle ist bereits vergeben

# BusinessRule.ParzelleNumberExists
source: A plot with number {0} already exists in this district
de_de: Eine Parzelle mit der Nummer {0} existiert bereits in diesem Bezirk

# BusinessRule.AntragNotFound
source: The specified application was not found
de_de: Der angegebene Antrag wurde nicht gefunden

# BusinessRule.AntragStatusInvalid
source: The application status is invalid for this operation
de_de: Der Antragsstatus ist für diese Operation ungültig

# BusinessRule.InsufficientPermissions
source: You do not have sufficient permissions for this operation
de_de: Sie haben nicht die erforderlichen Berechtigungen für diese Operation

# BusinessRule.RateLimitExceeded
source: Request rate limit exceeded. Please try again later
de_de: Das Anfragenlimit wurde überschritten. Bitte versuchen Sie es später erneut

# BusinessRule.InvalidDateRange
source: The specified date range is invalid
de_de: Der angegebene Datumsbereich ist ungültig

# BusinessRule.RequiredFieldMissing
source: Required field {0} is missing
de_de: Das erforderliche Feld {0} fehlt

# BusinessRule.InvalidFormat
source: Field {0} has an invalid format
de_de: Das Feld {0} hat ein ungültiges Format

# BusinessRule.ValueOutOfRange
source: Value for {0} is out of valid range
de_de: Der Wert für {0} liegt außerhalb des gültigen Bereichs

# BusinessRule.Generic
source: Business rule error: {0}
de_de: Geschäftsregelfehler: {0}

# Operation.Create
source: Create
de_de: Erstellen

# Operation.Update
source: Update
de_de: Aktualisieren

# Operation.Delete
source: Delete
de_de: Löschen

# Operation.Get
source: Get
de_de: Abrufen

# Operation.Search
source: Search
de_de: Suchen

# Operation.Assign
source: Assign
de_de: Vergeben

# Success.Created
source: Successfully created
de_de: Erfolgreich erstellt

# Success.Updated
source: Successfully updated
de_de: Erfolgreich aktualisiert

# Success.Deleted
source: Successfully deleted
de_de: Erfolgreich gelöscht

# Success.Assigned
source: Successfully assigned
de_de: Erfolgreich vergeben

# Detail.InvalidPageSize
source: Page size must be between 1 and 100
de_de: Die Seitengröße muss zwischen 1 und 100 liegen

# Detail.InvalidPageNumber
source: Page number must be greater than 0
de_de: Die Seitennummer muss größer als 0 sein

# Detail.InvalidSortField
source: Sort field '{0}' is invalid. Valid fields are: {1}
de_de: Das Sortierfeld '{0}' ist ungültig. Gültige Felder sind: {1}

# Detail.InvalidSearchTerm
source: Search term must be at least {0} characters long
de_de: Der Suchbegriff muss mindestens {0} Zeichen lang sein

# Detail.IdMismatch
source: URL ID does not match request body ID
de_de: Die ID in der URL stimmt nicht mit der ID im Anfragekörper überein

# Detail.EmptyGuid
source: ID cannot be empty
de_de: Die ID darf nicht leer sein
